---
kind: type
id: T:Autodesk.Revit.DB.EdgeEndPoint
source: html/3388e8f3-22d4-a411-a3da-450c16a31bc5.htm
---
# Autodesk.Revit.DB.EdgeEndPoint

Represents the start or the end point of an Edge.

## Syntax (C#)
```csharp
public class EdgeEndPoint : IDisposable
```